Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: A relative reference that begins with a single slash character is termed an absolute-path reference.
zh_cn: 以单个斜杠字符开头的相对引用称为绝对路径引用。

source: A relative reference that begins with two slash characters is termed a network-path reference; such references are rarely used.
zh_cn: 以两个斜杠字符开头的相对引用称为网络路径引用；这种参考很少使用。

source: A relative reference that does not begin with a slash character is termed a relative-path reference.
zh_cn: 不以斜杠字符开头的相对引用称为相对路径引用。

source: A request message from a client to a server includes, within the first line of that message, the method to be applied to the resource, the identifier of the resource, and the protocol version in use.
zh_cn: 从客户端到服务器的请求消息在该消息的第一行内包括要应用于资源的方法，资源的标识符和正在使用的协议版本。

source: A request method is considered "idempotent" if the intended effect on the server of multiple identical requests with that method is the same as the effect for a single such request.
zh_cn: 如果使用该方法对服务器的多个相同请求的预期效果与单个此类请求的效果相同，则请求方法被视为“幂等”。

source: A request or response message that travels the whole chain will pass through four separate connections.
zh_cn: 传输整个链的请求或响应消息将通过四个单独的连接。

source: A request-line begins with a method token, followed by a single space (SP), the request-target, another single space (SP), the protocol version, and ends with CRLF.
zh_cn: 请求行以方法标记开头，后跟单个空格(SP)，请求目标，另一个空格(SP)，协议版本，以 CRLF 结束。

source: A reserved subset of those characters may be used to delimit syntax components within a URI while the remaining characters, including both the unreserved set and those reserved characters not acting as delimiters, define each component's identifying data.
zh_cn: 这些字符的保留子集可用于界定 URI 内的语法组件，而其余字符(包括未保留集和未充当分隔符的保留字符)定义每个组件的标识数据。

source: A reset is valid if its sequence number is in the window.
zh_cn: 如果序列号在窗口中，则重置有效。

source: A reset must not be sent if it is not clear that this is the case.
zh_cn: 如果不清楚情况是否如此，则不得发送重置。

source: A resource can be anything that has identity.
zh_cn: 资源可以是任何具有标识的东西。

source: A resource is not necessarily accessible via the Internet; e.g., human beings, corporations, and bound books in a library can also be resources.
zh_cn: 资源不一定通过互联网访问；例如，人，公司和图书馆中的装订书籍也可以是资源。

source: A resource may have one, or more than one, representation(s) associated with it at any given instant.
zh_cn: 资源可以在任何给定时刻具有与其相关联的一个或多于一个表示。

source: A response is "cacheable" if a cache is allowed to store a copy of the response message for use in answering subsequent requests.
zh_cn: 如果允许高速缓存存储响应消息的副本以用于回答后续请求，则响应是“可高速缓存的”。

source: A response is also first-hand if its validity has just been checked directly with the origin server.
zh_cn: 如果直接使用原始服务器检查其有效性，则响应也是第一手的。

source: A response is cacheable if a cache is allowed to store a copy of the response message for use in answering subsequent requests.
zh_cn: 如果允许缓存存储响应消息的副本以用于回答后续请求，则响应是可缓存的。

source: A response is first-hand if it comes directly and without unnecessary delay from the origin server, perhaps via one or more proxies.
zh_cn: 如果直接来自原始服务器而没有不必要的延迟，可能是通过一个或多个代理，则响应是第一手的。

source: A response is fresh if its age has not yet exceeded its freshness lifetime.
zh_cn: 如果它的年龄尚未超过其新鲜寿命，则响应是新鲜的。

source: A response is stale if its age has passed its freshness lifetime.
zh_cn: 如果其年龄已超过其新鲜度，则响应是陈旧的。

source: A response that has neither chunked transfer coding nor Content-Length is terminated by closure of the connection and, thus, is considered complete regardless of the number of message body octets received, provided that the header section was received intact.
zh_cn: 通过关闭连接来终止既没有分块传输编码也没有内容长度的响应，因此，无论接收到的消息体八位字节的数量是多少都被认为是完整的，只要首部部分被完整地接收。

source: A scheme may define a default port.
zh_cn: 方案可以定义默认端口。

source: A segment is judged to occupy a portion of valid receive sequence space if
zh_cn: 判断报文段占用有效接收序列空间的一部分，如果

source: A segment on the retransmission queue is fully acknowledged if the sum of its sequence number and length is less or equal than the acknowledgment value in the incoming segment.
zh_cn: 如果重传队列的序列号和长度之和小于或等于传入报文段中的确认值，则完全确认该报文段。

source: A semi-colon, set off some distance to the right of rule text, starts a comment that continues to the end of line.
zh_cn: 一个分号，在规则文本右侧偏离一段距离，开始继续到行尾的注释。

source: A sender MUST NOT apply chunked more than once to a message body (i.e., chunking an already chunked message is not allowed).
zh_cn: 发送方不得多次对消息体应用分块(即，不允许对已经分块的消息进行分块)。

source: A sender MUST NOT generate BWS in messages.
zh_cn: 发送者不得在消息中生成 BWS。

source: A sender MUST NOT generate a message that includes line folding (i.e., that has any field-value that contains a match to the obs-fold rule) unless the message is intended for packaging within the message/http media type.
zh_cn: 发送者不得生成包含行折叠的消息(即，具有包含与遮蔽折叠规则匹配的任何字段值)，除非该消息用于在 message/http 媒体类型内打包。

source: A sender MUST NOT generate an "http" URI with an empty host identifier.
zh_cn: 发送者不得生成带有空主机标识符的“http”URI。

source: A sender MUST NOT generate multiple header fields with the same field name in a message unless either the entire field value for that header field is defined as a comma-separated list [i.e., #(values)] or the header field is a well-known exception (as noted below).
zh_cn: 发送者不得在消息中生成具有相同字段名称的多个首部字段，除非该首部字段的整个字段值定义为以逗号分隔的列表 [ 即, #(values)] 或首部字段是一个众所周知的例外(如下所述)。

source: A sender MUST NOT generate protocol elements that convey a meaning that is known by that sender to be false.
zh_cn: 发送方不得生成协议元素，以传达该发送方已知的错误含义。

source: A sender MUST NOT generate protocol elements that do not match the grammar defined by the corresponding ABNF rules.
zh_cn: 发送方不得生成与相应 ABNF 规则定义的语法不匹配的协议元素。

source: A sender MUST NOT generate the userinfo subcomponent (and its "@" delimiter) when an "http" URI reference is generated within a message as a request target or header field value.
zh_cn: 当在消息中生成“http”URI 引用作为请求目标或首部字段值时，发送方不得生成 userinfo 子组件(及其“@”分隔符)。

source: A sender MUST NOT send a Content-Length header field in any message that contains a Transfer-Encoding header field.
zh_cn: 发送方不得在包含 Transfer-Encoding 首部字段的任何消息中发送 Content-Length 首部字段。

source: A sender MUST NOT send a connection option corresponding to a header field that is intended for all recipients of the payload.
zh_cn: 发送方不得发送与首部字段相对应的连接选项，该首部字段适用于有效载荷的所有接收者。

source: A sender MUST NOT send whitespace between the start-line and the first header field.
zh_cn: 发送者不得在起始行和第一个首部字段之间发送空格。

source: A sender MUST remove the received Content-Length field prior to forwarding such a message downstream.
zh_cn: 发送方必须在向下游转发此类消息之前删除收到的 Content-Length 字段。

source: A sender SHOULD NOT generate a quoted-pair in a comment except where necessary to quote parentheses ["(" and ")"] and backslash octets occurring within that comment.
zh_cn: 发送者不应该在注释中生成引用对，除非必要引用括号 [“(”和“)”] 和在该注释中出现的反斜杠八位字节。

source: A sender SHOULD NOT generate a quoted-pair in a quoted-string except where necessary to quote DQUOTE and backslash octets occurring within that string.
zh_cn: 发送者不应该在带引号的字符串中生成带引号对，除非必要引用该字符串中出现的 DQUOTE 和反斜杠八位字节。

source: A sender SHOULD generate RWS as a single SP.
zh_cn: 发送者应该将 RWS 生成为单个 SP。

source: A sender shall:
zh_cn: 发送者应：

source: A sequence number is incremented after each record: specifically, the first record transmitted under a particular connection state MUST use sequence number 0.
zh_cn: 序列号在每个记录之后递增：具体地说，在特定连接状态下发送的第一个记录必须使用序列号 0。

source: A sequence of one or more consecutive zero-valued 16-bit pieces within the address may be elided, omitting all their digits and leaving exactly two consecutive colons in their place to mark the elision.
zh_cn: 可以省略地址内的一个或多个连续的零值 16 位片段的序列，省略它们的所有数字并在它们的位置留下恰好两个连续的冒号以标记省略号。

source: A sequence that never has side effects is idempotent, by definition (provided that no concurrent operations are being executed on the same set of resources).
zh_cn: 根据定义，从不具有副作用的序列是幂等的(假设在同一组资源上没有执行并发操作)。

source: A server MAY choose to ignore the order of preference indicated by the client and select the new protocol(s) based on other factors, such as the nature of the request or the current load on the server.
zh_cn: 服务器可以选择忽略客户端指示的优先顺序，并根据其他因素选择新协议，例如请求的性质或服务器上的当前负载。

source: A server MAY ignore a received Upgrade header field if it wishes to continue using the current protocol on that connection.
zh_cn: 如果服务器希望继续使用该连接上的当前协议，则可以忽略收到的 Upgrade 首部字段。

source: A server MAY process a sequence of pipelined requests in parallel if they all have safe methods (Section 4.2.1 of [RFC7231]), but it MUST send the corresponding responses in the same order that the requests were received.
zh_cn: 如果服务器都有安全的方法([RFC7231] 的第 4.2.1 节)，它可以并行处理一系列流水线请求，但它必须按照接收请求的相同顺序发送相应的响应。

source: A server MAY reject a request that contains a message body but not a Content-Length by responding with 411 (Length Required).
zh_cn: 服务器可以通过响应 411(需要长度)来拒绝包含消息体但不包含 Content-Length 的请求。

source: A server MAY request that a client present an OCSP response with its certificate by sending an empty "status_request" extension in its CertificateRequest message.
zh_cn: 服务器可以通过在其 CertificateRequest 消息中发送空的“status_request”扩展来请求客户端使用其证书呈现 OCSP 响应。

source: A server MAY send a Content-Length header field in a 304 (Not Modified) response to a conditional GET request (Section 4.1 of [RFC7232]); a server MUST NOT send Content-Length in such a response unless its field-value equals the decimal number of octets that would have been sent in the payload body of a 200 (OK) response to the same request.
zh_cn: 服务器可以在 304(未修改)响应中向条件 GET 请求发送 Content-Length 首部字段([RFC7232] 的第 4.1 节);服务器不得在这样的响应中发送 Content-Length，除非它的字段值等于在相同请求的 200(OK)响应的有效载荷体中发送的十进制八位字节数。

source: A server MAY send a Content-Length header field in a response to a HEAD request (Section 4.3.2 of [RFC7231]); a server MUST NOT send Content-Length in such a response unless its field-value equals the decimal number of octets that would have been sent in the payload body of a response if the same request had used the GET method.
zh_cn: 服务器可以在对 HEAD 请求的响应中发送 Content-Length 首部字段([RFC7231] 的第 4.3.2 节);但是是有条件的，只有在它的字段值等于使用 GET 方法的相同的请求的有效载荷主体的长度时，服务器才能在这样的响应中发送 Content-Length，表示的是有效载荷主体的八位字节的十进制数。

source: A server MAY send an HTTP/1.0 response to a request if it is known or suspected that the client incorrectly implements the HTTP specification and is incapable of correctly processing later version responses, such as when a client fails to parse the version number correctly or when an intermediary is known to blindly forward the HTTP-version even when it doesn't conform to the given minor version of the protocol.
zh_cn: 如果服务器已知或怀疑客户端错误地实现了 HTTP 规范并且无法正确处理更高版本的响应(例如客户端无法正确解析版本号或何时)，则可以向请求发送 HTTP/1.0 响应已知中介即使在不符合协议的给定次要版本的情况下也盲目地转发 HTTP 版本。

source: A server MAY send an Upgrade header field in any other response to advertise that it implements support for upgrading to the listed protocols, in order of descending preference, when appropriate for a future request.
zh_cn: 服务器可以在任何其他响应中发送升级首部字段，以通告它实现对升级到列出的协议的支持，按照优先级降序的顺序，适用于将来的请求。

source: A server MUST NOT apply a request to the target resource until the entire request header section is received, since later header fields might include conditionals, authentication credentials, or deliberately misleading duplicate header fields that would impact request processing.
zh_cn: 在收到整个请求首部部分之前，服务器不得向目标资源应用请求，因为后面的首部字段可能包括条件，身份验证凭据或故意误导重复的首部字段，这些字段会影响请求处理。

source: A server MUST NOT send a Content-Length header field in any 2xx (Successful) response to a CONNECT request (Section 4.3.6 of [RFC7231]).
zh_cn: 服务器不得在对 CONNECT 请求的任何 2xx(成功)响应中发送 Content-Length 首部字段([RFC7231] 的第 4.3.6 节)。

source: A server MUST NOT send a Content-Length header field in any response with a status code of 1xx (Informational) or 204 (No Content).
zh_cn: 服务器不得在状态代码为 1xx(信息)或 204(无内容)的任何响应中发送 Content-Length 首部字段。

source: A server MUST NOT send a Transfer-Encoding header field in any 2xx (Successful) response to a CONNECT request (Section 4.3.6 of [RFC7231]).
zh_cn: 服务器不得在对 CONNECT 请求的任何 2xx(成功)响应中发送 Transfer-Encoding 首部字段([RFC7231] 的第 4.3.6 节)。

source: A server MUST NOT send a Transfer-Encoding header field in any response with a status code of 1xx (Informational) or 204 (No Content).
zh_cn: 服务器不得在状态代码为 1xx(信息)或 204(无内容)的任何响应中发送 Transfer-Encoding 首部字段。

source: A server MUST NOT send a response containing Transfer-Encoding unless the corresponding request indicates HTTP/1.1 (or later).
zh_cn: 除非相应的请求指示 HTTP/1.1(或更高版本)，否则服务器不得发送包含 Transfer-Encoding 的响应。

source: A server MUST NOT send a version to which it is not conformant.
zh_cn: 服务器不得发送不符合的版本。

source: A server MUST NOT send any Transfer-Encoding or Content-Length header fields in a 2xx (Successful) response to CONNECT.
zh_cn: 服务器不得在对 CONNECT 的 2xx(成功)响应中发送任何 Transfer-Encoding 或 Content-Length 首部字段。

source: A server MUST NOT send transfer-codings to an HTTP/1.0 client.
zh_cn: 服务器不得向 HTTP/1.0 客户端发送传输编码。

source: A server MUST NOT switch protocols unless the received message semantics can be honored by the new protocol; an OPTIONS request can be honored by any protocol.
zh_cn: 服务器不得切换协议，除非新协议能够接受所接收的消息语义；任何协议都可以遵守 OPTIONS 请求。

source: A server MUST NOT switch to a protocol that was not indicated by the client in the corresponding request's Upgrade header field.
zh_cn: 服务器不得切换到客户端在相应请求的 Upgrade 首部字段中未指示的协议。

source: A server MUST accept ClientHello messages both with and without the extensions field, and (as for all other messages) it MUST check that the amount of data in the message precisely matches one of these formats; if not, then it MUST send a fatal "decode_error" alert.
zh_cn: 服务器必须接受带有和不带扩展字段的 ClientHello 消息，并且(对于所有其他消息)它必须检查消息中的数据量是否精确匹配这些格式之一；如果没有，那么它必须发送一个致命的“decode_error”警报。

source: A server MUST generate a Content-Length field with a value of "0" if no payload body is to be sent in the response.
zh_cn: 如果在响应中没有要发送有效载荷主体，则服务器必须生成值为“0”的 Content-Length 字段。

source: A server MUST ignore an Upgrade header field that is received in an HTTP/1.0 request.
zh_cn: 服务器必须忽略 HTTP/1.0 请求中收到的 Upgrade 首部字段。

source: A server MUST read the entire request message body or close the connection after sending its response, since otherwise the remaining data on a persistent connection would be misinterpreted as the next request.
zh_cn: 服务器必须在发送响应后读取整个请求消息体或关闭连接，否则持久连接上的剩余数据将被误解为下一个请求。

source: A server MUST reject any received request message that contains whitespace between a header field-name and colon with a response code of 400 (Bad Request).
zh_cn: 服务器必须拒绝任何收到的包含首部字段名和冒号之间的空格的请求消息，以响应代码为 400(错误请求)。

source: A server MUST respond with a 400 (Bad Request) status code to any HTTP/1.1 request message that lacks a Host header field and to any request message that contains more than one Host header field or a Host header field with an invalid field-value.
zh_cn: 服务器必须使用 400(错误请求)状态代码响应任何缺少主机首部字段的 HTTP/1.1 请求消息，以及包含多个主机首部字段的任何请求消息或具有无效字段值的主机首部字段。

source: A server MUST send its responses to those requests in the same order that the requests were received.
zh_cn: 服务器必须按照收到请求的顺序发送对这些请求的响应。

source: A server SHOULD read and forward a message-body on any request; if the request method does not include defined semantics for an entity-body, then the message-body SHOULD be ignored when handling the request.
zh_cn: 服务器应该在任何请求上读取和转发消息主体；如果请求方法不包含实体主体的定义语义，那么在处理请求时应该忽略消息主体。

source: A server SHOULD return 414 (Request-URI Too Long) status if a URI is longer than the server can handle (see section 10.4.15).
zh_cn: 如果 URI 长于服务器可以处理的长度，服务器应该返回 414(Request-URI Too Long)状态(参见 10.4.15 节)。

source: A server SHOULD send a response version equal to the highest version to which the server is conformant that has a major version less than or equal to the one received in the request.
zh_cn: 服务器应该发送一个响应版本，该版本等于服务器符合的最高版本，其主要版本小于或等于请求中收到的版本。

source: A server SHOULD sustain persistent connections, when possible, and allow the underlying transport's flow-control mechanisms to resolve temporary overloads, rather than terminate connections with the expectation that clients will retry.
zh_cn: 服务器应尽可能维持持久连接，并允许底层传输的流控制机制解决临时重载，而不是终止连接，期望客户端将重试。

source: A server can send a 505 (HTTP Version Not Supported) response if it wishes, for any reason, to refuse service of the client's major protocol version.
zh_cn: 如果服务器因任何原因希望拒绝服务客户端的主要协议版本，则可以发送 505(HTTP 版本不支持)响应。

source: A server generating a successful response to OPTIONS SHOULD send any header fields that might indicate optional features implemented by the server and applicable to the target resource (e.g., Allow), including potential extensions not defined by this specification.
zh_cn: 生成对 OPTIONS 的成功响应的服务器应该发送任何可能指示由服务器实现并且适用于目标资源(例如，Allow)的可选特征的首部字段，包括未由该规范定义的潜在扩展。

source: A server listens on a connection for a request, parses each message received, interprets the message semantics in relation to the identified request target, and responds to that request with one or more response messages.
zh_cn: 服务器监听请求的连接，解析收到的每个消息，解释与标识的请求目标相关的消息语义，并使用一个或多个响应消息响应该请求。

source: A server responds to a client's request by sending one or more HTTP response messages, each beginning with a status line that includes the protocol version, a success or error code, and textual reason phrase (Section 3.1.2), possibly followed by header fields containing server information, resource metadata, and representation metadata (Section 3.2), an empty line to indicate the end of the header section, and finally a message body containing the payload body (if any, Section 3.3).
zh_cn: 服务器通过发送一条或多条 HTTP 响应消息来响应客户端的请求，每条消息都以包含协议版本、成功或错误代码以及文本原因短语的状态行开头(第 3.1.2 节)，可能后跟包含服务器信息、资源元数据和表示元数据的首部字段(第 3.2 节)，一个空行表示首部部分的结尾，最后是一个包含有效载荷主体的消息主体(如果有的话，第 3.3 节)。

source: A server that does not support persistent connections MUST send the "close" connection option in every response message that does not have a 1xx (Informational) status code.
zh_cn: 不支持持久连接的服务器必须在每个没有 1xx(信息)状态代码的响应消息中发送“close”连接选项。

source: A server that does not support such an extension MAY discard the request body.
zh_cn: 不支持此类扩展的服务器可以丢弃请求正文。

source: A server that receives a "close" connection option MUST initiate a close of the connection (see below) after it sends the final response to the request that contained "close".
zh_cn: 接收“close”连接选项的服务器必须在向包含“close”的请求发送最终响应后启动连接关闭(见下文)。

source: A server that receives a method longer than any that it implements SHOULD respond with a 501 (Not Implemented) status code.
zh_cn: 接收比其实现的任何方法更长的方法的服务器应该使用 501(未实现)状态代码进行响应。

source: A server that receives a request header field, or set of fields, larger than it wishes to process MUST respond with an appropriate 4xx (Client Error) status code.
zh_cn: 接收大于其希望处理的请求首部字段或字段集的服务器必须以适当的 4xx(客户端错误)状态代码进行响应。

source: A server that receives a request message with a transfer coding it does not understand SHOULD respond with 501 (Not Implemented).
zh_cn: 接收带有不可理解的传输编码的请求消息的服务器应该响应 501(未实现)。

source: A server that receives a request-target longer than any URI it wishes to parse MUST respond with a 414 (URI Too Long) status code (see Section 6.5.12 of [RFC7231]).
zh_cn: 如果服务器接收到的请求目标比它希望解析的任何 URI 都长，则该服务器必须使用 414(URI 太长)状态代码响应(请参阅 [RFC7231] 的第 6.5.12 节)。

source: A server that receives an incomplete request message, usually due to a canceled request or a triggered timeout exception, MAY send an error response prior to closing the connection.
zh_cn: 接收不完整请求消息的服务器(通常由于取消请求或触发超时异常)可能会在关闭连接之前发送错误响应。

source: A server that receives an obs-fold in a request message that is not within a message/http container MUST either reject the message by sending a 400 (Bad Request), preferably with a representation explaining that obsolete line folding is unacceptable, or replace each received obs-fold with one or more SP octets prior to interpreting the field value or forwarding the message downstream.
zh_cn: 接收到请求消息中的 obs 折叠（不在 message/http 容器中）的服务器必须要么通过发送 400（错误的请求）来拒绝该消息，最好使用一个表示来解释过时的行折叠是不可接受的，或者将每个接收到的 obs 折叠替换为一个或多个八位字节的 sp 在解释字段值或将消息转发到下游之前。

source: A server that sends a "close" connection option MUST initiate a close of the connection (see below) after it sends the response containing "close".
zh_cn: 发送“close”连接选项的服务器必须在发送包含“close”的响应后启动连接关闭(见下文)。

source: A server that sends a 101 (Switching Protocols) response MUST send an Upgrade header field to indicate the new protocol(s) to which the connection is being switched; if multiple protocol layers are being switched, the sender MUST list the protocols in layer-ascending order.
zh_cn: 发送 101（交换协议）响应的服务器必须发送升级首部字段，以指示正在切换连接的新协议；如果正在切换多个协议层，则发送方必须按层升序列出协议。

source: A server that sends a 426 (Upgrade Required) response MUST send an Upgrade header field to indicate the acceptable protocols, in order of descending preference.
zh_cn: 发送 426(需要升级)响应的服务器必须按优先级降序发送升级首部字段以指示可接受的协议。

source: A server using chunked transfer-coding in a response MUST NOT use the trailer for any header fields unless at least one of the following is true:
zh_cn: 在响应中使用分块传输编码的服务器绝不能将 trailer 用于任何首部字段，除非至少满足下列条件之一：

source: A server which acts as an intermediary for some other server.
zh_cn: 作为其他服务器的中介的服务器。

source: A server which is authenticating with a certificate MAY optionally request a certificate from the client.
zh_cn: 使用证书进行身份验证的服务器可以选择从客户端请求证书。

source: A server which negotiates TLS 1.3 MUST respond by sending a "supported_versions" extension containing the selected version value (0x0304).
zh_cn: 协商 TLS 1.3 的服务器必须通过发送包含所选版本值(0x0304)的“supported_versions”扩展来响应。

source: A server which negotiates a version of TLS prior to TLS 1.3 MUST set ServerHello.version and MUST NOT send the "supported_versions" extension.
zh_cn: 协商 TLS 1.3 之前版本的服务器必须设置 ServerHello.version 并且不得发送“supported_versions”扩展。

source: A server which receives an "early_data" extension MUST behave in one of three ways:
zh_cn: 接收“early_data”扩展的服务器必须以下列三种方式之一运行：

source: A server which receives an entity-body with a transfer-coding it does not understand SHOULD return 501 (Unimplemented), and close the connection.
zh_cn: 如果接收到具有不理解的传输编码的实体主体，服务器应该返回 501(未实现)，并关闭连接。

source: A significant difference between HTTP/1.1 and earlier versions of HTTP is that persistent connections are the default behavior of any HTTP connection.
zh_cn: HTTP/1.1 和早期版本的 HTTP 之间的显着差异是持久连接是任何 HTTP 连接的默认行为。

source: A simultaneous CLOSE by users at both ends of a connection causes FIN segments to be exchanged.
zh_cn: 连接两端的用户同时发生 CLOSE 会导致 FIN 报文段被交换。

source: A single resource MAY be identified by many different URIs.
zh_cn: 单个资源可以由许多不同的 URI 标识。

source: A single-user client SHOULD NOT maintain more than 2 connections with any server or proxy.
zh_cn: 单用户客户端不应该与任何服务器或代理保持 2 个以上的连接。

source: A small regret about introducing backpressure in RxJava 0.x is that instead of having a separate base reactive class, the `Observable` itself was retrofitted.
zh_cn: 关于在 RxJava 0.x 中引入背压的一个小遗憾是，不再使用单独的基础响应类，`Observable` 本身就进行了改造。

source: A standard format for such a representation is not defined by this specification, but might be defined by future extensions to HTTP.
zh_cn: 此规范未定义此类表示的标准格式，但可能由 HTTP 的未来扩展定义。

source: A string of text is parsed as a single value if it is quoted using double-quote marks.
zh_cn: 如果使用双引号引用，则将一串文本解析为单个值。

source: A string of text is parsed as a single word if it is quoted using double-quote marks.
zh_cn: 如果使用双引号引用，则将一串文本解析为简单单词。

source: A subset of the reserved characters (gen-delims) is used as delimiters of the generic URI components described in Section 3.
zh_cn: 保留字符的子集(gen-delims)用作第 3 节中描述的通用 URI 组件的分隔符。

source: A successful PUT of a given representation would suggest that a subsequent GET on that same target resource will result in an equivalent representation being sent in a 200 (OK) response.
zh_cn: 成功地 PUT 一个给定的表示将意味着随后对同一目标资源的获取将导致在 200(OK)响应中发送一个等价的表示。

source: A successful response SHOULD be 200 (OK) if the response includes an entity describing the status, 202 (Accepted) if the action has not yet been enacted, or 204 (No Content) if the action has been enacted but the response does not include an entity.
zh_cn: 如果响应包括描述状态的实体，则成功响应应为 200(OK)，如果操作尚未执行，则应为 202(已接受);如果操作已执行但响应不包括一个实体，则应为 204(无内容)。
